---
kind: type
id: T:Autodesk.Revit.DB.TextNote
zh: 注释、文字注释
source: html/ecc1ce1c-d754-96d0-35db-ca2d1d84c57c.htm
---
# Autodesk.Revit.DB.TextNote

**中文**: 注释、文字注释

A class representing text note annotations in Revit.

## Syntax (C#)
```csharp
public class TextNote : TextElement
```